app/views/entries/_entry.html.erb

	<span class="timestamp">
		Posted At <%= entry.created_at.localtime.strftime('%m/%d/%Y - %H:%M:%S')%> - <%=link_to pluralize(entry.comments.count, "comment"), entry_path(entry, :anchor=>"entry_comments") %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 295]]