app/controllers/comments_controller.rb

	def create
		entry = Entry.find(params[:entry_id])
		if !entry.nil?
			comment = entry.comments.build(content: params[:comment][:content])
			comment.user_id = current_user.id
			if comment.save
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 304]]
INSERT INTO "comments" ("content", "entry_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "cczxcxzcxc"], ["entry_id", 304], ["user_id", 104], ["created_at", "2015-10-30 06:53:22.377108"], ["updated_at", "2015-10-30 06:53:22.377108"]]