app/controllers/entries_controller.rb

	def create
		#byebug
		@entry = current_user.entries.build(entry_params)
		if @entry.save
---
INSERT INTO "entries" ("content", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "vcbcvbcvb"], ["title", "vcbcvb"], ["user_id", 104], ["created_at", "2015-10-30 06:50:26.090322"], ["updated_at", "2015-10-30 06:50:26.090322"]]

	def show
		@entry = Entry.find_by(id: params[:id])
		@comments = @entry.comments.paginate(page: params[:page])
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 304]]
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 30 OFFSET 0  [["entry_id", 304]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 304]]