app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 86]]
SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "entries" WHERE "entries"."user_id" = ?  [["user_id", 1]]
---
  def show
  	@user = User.find_by(id: params[:id])
    @entries = @user.entries.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "password_digest", "activated", "activated_at", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save!